[
  {
    "idGrade": 1,
    "curso": "Engenharia de Computação",
    "ano": 2015,
    "periodos": [
      {
        "_id": "66731f040825fe7802ee48b3",
        "idPeriodo": 1,
        "disciplinas": [
          {
            "_id": "66731e3f0825fe7802ee4898",
            "codDisciplina": "MAT001",
            "nome": "Cálculo I",
            "cargaHoraria": 96,
            "ementa": "Funções. Limite e continuidade. Derivada. Integral. Integral imprópria."
          },
          {
            "_id": "66731e4e0825fe7802ee489b",
            "codDisciplina": "MAT011",
            "nome": "Geometria Analítica e Álgebra Linear",
            "cargaHoraria": 64,
            "ementa": "Vetores. Retas e planos. Cônicas e quádricas. Espaços Euclidianos. Matrizes e sistemas de\nequações lineares."
          },
          {
            "_id": "66731e570825fe7802ee489e",
            "codDisciplina": "DES201",
            "nome": "Desenho Técnico Básico",
            "cargaHoraria": 64,
            "ementa": "Normas gerais do desenho técnico. Desenho geométrico. Desenho de projeções. Normas para\nprojeções ortogonais no primeiro e terceiro diedro. Normas para cotagem. Representação de cortes e\nsecções de peças. Desenho em perspectiva. Desenvolvimento de sólidos geométricos."
          },
          {
            "_id": "66731e620825fe7802ee48a1",
            "codDisciplina": "FIS104",
            "nome": "Metodologia Científica",
            "cargaHoraria": 32,
            "coRequisito": "FIS114",
            "ementa": "Conceitos básicos de distribuições de erro. Algarismo significativo. Operações com algarismos\nsignificativos. Incerteza de medição. Erros sistemáticos e estatísticos. Valor médio e desvio padrão."
          },
          {
            "_id": "66731e6e0825fe7802ee48a4",
            "codDisciplina": "FIS114",
            "nome": "Laboratório de Metodologia Científica",
            "cargaHoraria": 16,
            "coRequisito": "FIS104",
            "ementa": "Laboratório de conceitos básicos de distribuições de erro. Algarismo significativo. Operações com\nalgarismos significativos. Incerteza de medição. Erros sistemáticos e estatísticos. Valor médio e desvio\npadrão. Propagação de incertezas. Tratamento estatístico da teoria de erros. Modelos e gráficos."
          },
          {
            "_id": "66731e790825fe7802ee48a7",
            "codDisciplina": "ECOP01",
            "nome": "Técnicas de Programação",
            "cargaHoraria": 32,
            "coRequisito": "ECOP11",
            "ementa": "Introdução. Itens fundamentais. Estruturas de controle. Variáveis compostas homogêneas."
          },
          {
            "_id": "66731e840825fe7802ee48aa",
            "codDisciplina": "ECOP11",
            "nome": "Laboratório de Técnicas de Programação",
            "cargaHoraria": 32,
            "coRequisito": "ECOP01",
            "ementa": "Experiências sobre: implementação de algoritmos estruturados, ferramentas computacionais, comandos básicos da linguagem C , operadores, estruturas de controle, funções, parâmetros de funções,\nrecursão, vetores, estruturas, ponteiros e strings."
          },
          {
            "_id": "66731e8c0825fe7802ee48ad",
            "codDisciplina": "ECO101",
            "nome": "Introdução à Engenharia",
            "cargaHoraria": 32,
            "ementa": "O curso de engenharia da computação na Universidade Federal de Itajubá. Introdução à engenharia da computação. Engenharia e sua evolução. A engenharia e a sociedade. A ética na engenharia."
          },
          {
            "_id": "66731e950825fe7802ee48b0",
            "codDisciplina": "ECOP00",
            "nome": "Algoritmos",
            "cargaHoraria": 32,
            "ementa": "Introdução. Conceito de algoritmo. Itens fundamentais. Estruturas de controle. Variáveis compostas homogêneas. Variáveis compostas heterogêneas. Introdução à linguagem C. Fluxo de controle. Funções. Parâmetros de funções. Recursão. Vetores. Estruturas. Ponteiros. Strings."
          }
        ]
      },
      {
        "idPeriodo": 2,
        "disciplinas": [
          {
            "codDisciplina": "MAT002",
            "nome": "Cálculo II",
            "cargaHoraria": 64,
            "preRequisitos": "MAT001\nMAT011",
            "ementa": "Sequencias e séries. Séries de potências. Séries de Taylor. Abertos no Rn. Funções de uma variável\nreal a valores em Rn. Curvas. Funções reais de varias variáveis reais a valores reais. Derivadas parciais."
          },
          {
            "codDisciplina": "BAC002",
            "nome": "Linguagem e Comunicação",
            "cargaHoraria": 64,
            "ementa": "Linguagem e Interação. Gêneros textuais orais e escritos. Estrutura, organização, planejamento,\nprodução e compreensão de textos técnicos e acadêmicos."
          },
          {
            "codDisciplina": "QUI102",
            "nome": "Química Geral",
            "cargaHoraria": 64,
            "coRequisito": "QUI112",
            "ementa": "Estrutura Atômica. Interações Interatômicas e Intermoleculares. Metais. Cálculos\nEstequiométricos. Termoquímica. Cinética Química. Eletroquímica."
          },
          {
            "codDisciplina": "QUI112",
            "nome": "Química Experimental",
            "cargaHoraria": 16,
            "coRequisito": "QUI102",
            "ementa": "Experiências sobre: preparação de soluções, transferência de elétrons em reações de oxi-redução,\ncaracterização dos elétrodos e do fluxo eletrônico em pilhas, eletrodeposição de metais, reações de\ncorrosão metálica e passivação superficial, corrosão galvânica, proteção catódica, corrosão sob tensão\nmecânica, corrosão eletrolítica, corrosão por aeração diferencial e corrosão por frestas."
          },
          {
            "codDisciplina": "FIS203",
            "nome": "Física Geral I",
            "cargaHoraria": 64,
            "preRequisitos": "MAT001",
            "ementa": "Movimento unidimensional. Movimento bidimensional. Leis de Newton. Trabalho e energiamecânica. Conservação do momento linear. Colisões. Rotações e momento angular. Dinâmica de corposrígidos."
          },
          {
            "codDisciplina": "FIS213",
            "nome": "Física Experimental I",
            "cargaHoraria": 16,
            "coRequisito": "FIS203",
            "ementa": "Experiências sobre: movimento unidimensional, movimento bidimensional, leis de Newton,trabalho, energia mecânica, conservação do momento linear, colisões, rotações, momento angular edinâmica de corpos rígidos."
          },
          {
            "codDisciplina": "ECOP02",
            "nome": "Estrutura de Dados",
            "cargaHoraria": 48,
            "preRequisitos": "ECOP01",
            "coRequisito": "ECOP12",
            "ementa": "Lista estática. Lista estática encadeada. Alocação dinâmica. Lista dinâmica simplesmente\nencadeada. Lista dinâmica duplamente encadeada. Listas circulares. Listas generalizadas. Pilhas. Filas."
          },
          {
            "codDisciplina": "ECOP12",
            "nome": "Laboratório de Estrutura de Dados",
            "cargaHoraria": 32,
            "preRequisitos": "ECOP01",
            "coRequisito": "ECOP02",
            "ementa": "Laboratório de Lista estática. Lista estática encadeada. Alocação dinâmica. Lista dinâmica\nsimplesmente encadeada. Lista dinâmica duplamente encadeada. Listas circulares. Listas generalizadas.\nPilhas. Filas. Recursão. Árvores binárias de busca. Árvores balanceadas AVL. Árvores múltiplas. Funções\nde manipulação de arquivos. Algoritmo de Huffman. Árvore B. Tabelas de dispersão. Tratamento de\ncolisões."
          },
          {
            "codDisciplina": "ECOM01",
            "nome": "Matemática Discreta",
            "cargaHoraria": 48,
            "coRequisito": "ECOM11",
            "ementa": "Conjuntos e funções. Noções de lógica e técnicas de demonstração. Relações. Combinatória."
          },
          {
            "codDisciplina": "ECOM11",
            "nome": "Laboratório de Matemática Discreta",
            "cargaHoraria": 16,
            "coRequisito": "ECOM01",
            "ementa": "Cláusulas de Horn. Cálculo Lambda. Introdução à Linguagem Prolog. Introdução à Linguagem\nHaskell."
          }
        ]
      },
      {
        "idPeriodo": 3,
        "disciplinas": [
          {
            "codDisciplina": "MAT003",
            "nome": "Cálculo III",
            "cargaHoraria": 64,
            "preRequisitos": "MAT001\nMAT011",
            "ementa": "Funções de várias variáveis reais a valores vetoriais. Campos vetoriais. Rotacional, divergente e\nlaplaciano. Integrais duplas e triplas. Integrais de linha. Campos conservativos. Integrais de superfície.\nFluxo de um campo vetorial. Teorema de Green no plano. Teorema de Stokes. Teorema da divergência de Gauss."
          },
          {
            "codDisciplina": "MAT021",
            "nome": "Equações Diferenciais I",
            "cargaHoraria": 64,
            "preRequisitos": "MAT001\nMAT011",
            "ementa": "Equações diferenciais de ordem um. Equações diferenciais lineares de ordem dois. Equações\ndiferenciais lineares de ordem mais alta. Solução em série para equações lineares de segunda ordem.\nSistemas de equações diferenciais lineares de ordem um."
          },
          {
            "codDisciplina": "EME311",
            "nome": "Mecânica dos Sólidos",
            "cargaHoraria": 64,
            "ementa": "Estática dos corpos rígidos. Forças distribuídas. Centro de gravidade e momento estático de áreas. Momentos e produtos de inércia. Treliças. Esforços em vigas e cabos. Tensões e deformações para cargas axiais. Torção. Flexão. Tensões combinadas. Tensões no plano. Flambagem. Deformações em vigas."
          },
          {
            "codDisciplina": "ECOM02",
            "nome": "Teoria dos Grafos",
            "cargaHoraria": 32,
            "preRequisitos": "ECOM01\nECOP02",
            "ementa": "Conceitos básicos. Representações. Árvores. Caminhos. Coloração. Fluxo em redes.\n Emparelhamento. Aplicações."
          },
          {
            "codDisciplina": "ECOP03",
            "nome": "Programação Orientada a Objetos",
            "cargaHoraria": 32,
            "preRequisitos": "ECOP01",
            "coRequisito": "ECOP03",
            "ementa": "Programação orientada a objetos. Classes e abstração de dados. Classes e objetos. Sobrecarga de\noperadores. Herança. Funções virtuais e polimorfismo. Noções de Tratamento de exceções. Gabaritos."
          },
          {
            "codDisciplina": "ECOP13",
            "nome": "Lab. de Programação Orientada a Objetos",
            "cargaHoraria": 32,
            "coRequisito": "ECOP13",
            "ementa": "Programação orientada a objetos. Classes e abstração de dados. Classes e objetos. Sobrecarga de\noperadores. Herança. Funções virtuais e polimorfismo. Noções de tratamento de exceções. Gabaritos."
          },
          {
            "codDisciplina": "EEL105",
            "nome": "Circuitos Elétricos I",
            "cargaHoraria": 48,
            "coRequisito": "EEL115",
            "ementa": "Conceitos básicos. Componentes e equipamentos elétricos e eletrônicos. Circuitos resistivos\nlineares. Circuitos não lineares. Teoria dos circuitos em regime permanente senoidal. Potência e energia."
          },
          {
            "codDisciplina": "EEL115",
            "nome": "Laboratório de Circuitos Elétricos I",
            "cargaHoraria": 16,
            "coRequisito": "EEL105",
            "ementa": "Experiências de laboratório sobre temas abordados na disciplina Circuitos Elétricos I."
          },
          {
            "codDisciplina": "ECOP04",
            "nome": "Programação Embarcada",
            "cargaHoraria": 32,
            "preRequisitos": "ECOP01",
            "coRequisito": "ECOP14",
            "ementa": "Conceitos gerais de computação embarcada. Programação de sistemas embarcados utilizandolinguagem C. Tipos de dados e operações com bits. Diretivas de compilação e pré-compilação. Utilizaçãode periféricos: entradas e saídas digitais, DAC, PWM, Serial RS232, timers e watchdog. Multiplexação deentradas e saídas (displays e teclado). Interrupções. Organização e arquitetura de programas para sistemasembarcados. Limitações de sistemas embarcados."
          },
          {
            "codDisciplina": "ECOP14",
            "nome": "Lab. de Programação Embarcada",
            "cargaHoraria": 32,
            "coRequisito": "ECOP04",
            "ementa": "Conceitos gerais de computação embarcada. Programação de sistemas embarcados utilizandolinguagem C. Tipos de dados e operações com bits. Diretivas de compilação e pré-compilação. Utilizaçãode periféricos: entradas e saídas digitais, DAC, PWM, Serial RS232, timers e watchdog. Multiplexação deentradas e saídas (displays e teclado). Interrupções. Organização e arquitetura de programas para sistemasembarcados. Limitações de sistemas embarcados."
          }
        ]
      },
      {
        "idPeriodo": 4,
        "disciplinas": [
          {
            "codDisciplina": "MAT022",
            "nome": "Equações Diferenciais II",
            "cargaHoraria": 64,
            "preRequisitos": "MAT021",
            "ementa": "Transformada de Laplace. Equações diferenciais não-lineares e estabilidade. Equações diferenciais\nparciais e séries de Fourier. Teoria de Sturm-Liouville."
          },
          {
            "codDisciplina": "EME205",
            "nome": "Fenômenos de Transporte",
            "cargaHoraria": 64,
            "ementa": "Aplicação dos conceitos básicos de termodinâmica: calor, trabalho, 1ª lei e a 2ª lei. ciclo de carnot,\nde rankine (turbina a vapor), de brayton-joule (turbina a gás). máquinas térmicas (refrigerador e bomba de\ncalor). Escoamentos laminar e turbulento e determinação de perda de carga.a equação de bernoulli e a sua\naplicação aos problemas de engenharia. Estudo de modelos e de protótipos. Condução de calor em\nparedes compostas, transitória. Analogia entre fluxo de calor e fluxo elétrico, espessura crítica de\nisolação. Transferência de calor por convecção forçada em escoamentos laminar e turbulento, convecção\nnatural. Transferência de calor por irradiação, radiação solar, efeito de radiação em medição de\ntemperaturas. analogia entre a transferência de massa, de calor e de quantidade de movimento."
          },
          {
            "codDisciplina": "FIS403",
            "nome": "Física Geral III",
            "cargaHoraria": 64,
            "preRequisitos": "MAT001",
            "ementa": "Revisão de cálculo vetorial. O campo eletrostático. O potencial eletrostático. Capacitores edielétricos. Corrente e resistência elétrica. O campo magnetostático. Lei de Ampére. InduçãoEletromagnética. Campos elétricos e magnéticos variáveis no tempo."
          },
          {
            "codDisciplina": "FIS413",
            "nome": "Física Experimental III",
            "cargaHoraria": 16,
            "ementa": "Experiências sobre: campo e potencial eletrostáticos, capacitores, corrente e resistência elétricas,\ncampo magnetostático, campos elétricos e magnéticos variáveis no tempo."
          },
          {
            "codDisciplina": "ELTD01",
            "nome": "Eletrônica Digital I",
            "cargaHoraria": 48,
            "coRequisito": "ELTD11",
            "ementa": "Álgebra de Boole, Funções Lógicas, Circuitos Combinacionais: Multiplexadores,\nDemultiplexadores, Codificadores e Decodificadores,Sistemas de Numeração e Códigos, Latchs e Flip-\nFlops, Registradores, Contadores, Memórias Semicondutoras, Circuitos de Interface de Memórias,\nCircuitos Aritméticos."
          },
          {
            "codDisciplina": "ELTD11",
            "nome": "Laboratório de Eletrônica Digital I",
            "cargaHoraria": 16,
            "coRequisito": "ELTD01",
            "ementa": "Atividades práticas de laboratório abordando os conceitos de Funções\nLógicas, Circuitos Combinacionais, Latchs e Flip-flops, Registradores, Contadores, Memórias\nSemicondutoras e Circuitos Aritméticos."
          },
          {
            "codDisciplina": "ELTA00",
            "nome": "Introdução à Eletrônica Analógica",
            "cargaHoraria": 32,
            "ementa": "Amplificador operacional ideal. Conceito de realimentação negativa e positiva. Configurações\nlineares e não lineares. Dispositivos optoeletrônicos."
          },
          {
            "codDisciplina": "ELTA10",
            "nome": "Lab. de Introdução à Eletrônica Analógica",
            "cargaHoraria": 16,
            "coRequisito": "ELTA00",
            "ementa": "Laboratório de Amplificador operacional ideal. Conceito de realimentação negativa e positiva.\nConfigurações lineares e não lineares. Dispositivos optoeletrônicos."
          },
          {
            "codDisciplina": "EEL106",
            "nome": "Circuitos Elétricos II",
            "cargaHoraria": 32,
            "preRequisitos": "EEL105",
            "coRequisito": "EEL116",
            "ementa": "Ciclo, período, frequência, velocidade ou frequência angular, ângulo de fase, diferença de fase\n(defasagem), valores de pico, médio e eficaz. Conceito de fasor. Representação fasorial de tensões e\ncorrentes alternadas em regime permanente. Relação entre tensões e correntes senoidais em bipolos\nlineares. conceitos de impedância e admitância. Potência instantânea. Potências ativa e reativa. Potência\ncomplexa e aparente. Fator de potência."
          },
          {
            "codDisciplina": "EEL116",
            "nome": "Laboratório de Circuitos Elétricos II",
            "cargaHoraria": 16,
            "coRequisito": "EEL106",
            "ementa": "Ciclo, período, frequência, velocidade ou frequência angular, ângulo de fase, diferença de fase\n(defasagem), valores de pico, médio e eficaz. Conceito de fasor. Representação fasorial de tensões e\ncorrentes alternadas em regime permanente. Relação entre tensões e correntes senoidais em bipolos\nlineares. conceitos de impedância e admitância. Potência instantânea. Potências ativa e reativa. Potência\ncomplexa e aparente. Fator de potência."
          },
          {
            "codDisciplina": "ECOP05",
            "nome": "Programação Aplicada",
            "cargaHoraria": 32,
            "preRequisitos": "ECOP03",
            "coRequisito": "ECOP15",
            "ementa": "Introdução. Aplicativos e applets. Estruturas de controle. Métodos. Arrays. Programação baseadaem objetos. Programação orientada a objetos. Strings. Componentes gráficos. Componentes GUI.\nTratamento de exceções. Multithreading. Multimídia. Entrada e saída usual. Entrada e saída em arquivos.\nIntrodução a análise e projetos orientados a objetos."
          },
          {
            "codDisciplina": "ECOP15",
            "nome": "Laboratório de Programação Aplicada",
            "cargaHoraria": 32,
            "coRequisito": "ECOP05",
            "ementa": "Experiências de laboratório envolvendo: Aplicativos e applets. Estruturas de controle. Métodos.\nArrays. Programação baseada em objetos. Programação orientada a objetos. Strings. Componentes\ngráficos. Componentes GUI. Tratamento de exceções. Multithreading. Multimídia. Entrada e saída usual.\"Entrada e Saída em arquivos.Introdução a análise e projetos orientados a objetos."
          }
        ]
      },
      {
        "idPeriodo": 5,
        "disciplinas": [
          {
            "codDisciplina": "FIS502",
            "nome": "Eletromagnetismo",
            "cargaHoraria": 64,
            "preRequisitos": "FIS403",
            "ementa": "Grandezas eletromagnéticas fundamentais. Equações de Maxwell. Energia do campoeletromagnético. Ondas eletromagnéticas. Reflexão e refração da onda eletromagnética. Introdução àsondas guiadas."
          },
          {
            "codDisciplina": "FIS503",
            "nome": "Física Geral IV",
            "cargaHoraria": 64,
            "ementa": "Oscilador harmônico. Oscilações amortecidas e forçadas. Ondas mecânicas. Ondas sonoras. Ondas\neletromagnéticas. Óptica geométrica. Óptica física. Relatividade restrita. Física quântica."
          },
          {
            "codDisciplina": "FIS513",
            "nome": "Física Experimental IV",
            "cargaHoraria": 16,
            "coRequisito": "FIS503",
            "ementa": "Experiências sobre: oscilador harmônico, ondas mecânicas, óptica geométrica, óptica física e\nfísica quântica."
          },
          {
            "codDisciplina": "ECN001",
            "nome": "Economia",
            "cargaHoraria": 48,
            "ementa": "Natureza e método de economia. História do pensamento econômico. Microeconomia: a teoria depreço, demanda, oferta e distribuição. Macroeconomia: agregados macroeconômicos, teoria dadistribuição, teoria geral de Keynes, teoria monetária. Teoria do setor público. Teoria do desenvolvimentosócio-econômico. Teoria das relações internacionais."
          },
          {
            "codDisciplina": "ELTA01",
            "nome": "Eletrônica Analógica I",
            "cargaHoraria": 48,
            "preRequisitos": "EEL105",
            "ementa": "Materiais semicondutores. Diodos. Circuitos com diodos. Reguladores de tensão. Transistores\nbipolares de junção (BJTs): Modelamento, polarização, circuitos de chaveamento e amplificadores a\npequeno sinal."
          },
          {
            "codDisciplina": "ELTA11",
            "nome": "Laboratório de Eletrônica Analógica I",
            "cargaHoraria": 16,
            "coRequisito": "ELTA01",
            "ementa": "Diodos: curva característica, uso de osciloscópio, influência da temperatura tempo de recuperação\nreverso, reta de carga. Ação retificadora, verificação do efeito do filtro capacitivo. Transistores bipolares:\ndispersão do ganho DC, circuitos de polarização, estabilidade do ponto de operação, operação como\nchave, amplificador e seguidor de emissor."
          },
          {
            "codDisciplina": "ECAC01",
            "nome": "Modelagem e Análise de Sistemas Dinâmicos",
            "cargaHoraria": 64,
            "preRequisitos": "MAT022",
            "coRequisito": "ECAC11",
            "ementa": "FUNDAMENTOS DE DINÂMICA CONTÍNUA: Caracterização de sistemas lineares – Sistemas\nde primeira, segunda ordem e ordem superior; Soluções de equações diferenciais lineares – Entrada nula,\nentrada forçada, BIBO estabilidade; Representação de estado – Espaço Canônico, controlabilidade,\nobservabilidade, autovalores, autovetores, conversão similaridade; Solução via transformada de Laplace -\nFunção de transferência (solução de equação diferencial), polos e zeros, teorema do valor final,\nestabilidade, fase mínima, atraso de transporte; Resposta em frequência – Diagrama de Bode, Nyquist,\nNichols; FUNDAMENTOS DE DINÂMICA DISCRETA: Teoria da amostragem – transformada estrela,\nTeorema de Nyquist; Soluções de equações a diferenças lineares – Análise de resíduos, zoh;"
          },
          {
            "codDisciplina": "ECAC11",
            "nome": "Introdução à Análise de Sinais",
            "cargaHoraria": 16,
            "preRequisitos": "MAT022",
            "coRequisito": "ECAC01",
            "ementa": "Definições. Análise de Sinais. Introdução aos Sistemas Dinâmicos. Simulação em Linguagens\nMatemáticas. Aplicação de Transformada de Lapace. Aplicação de Transformada de Fourier. Simulações\natravés de computadores. Softwares de simulação."
          },
          {
            "codDisciplina": "ELTD02",
            "nome": "Eletrônica Digital II",
            "cargaHoraria": 32,
            "preRequisitos": "ELTD01",
            "ementa": "Famílias Lógicas e Interface, Circuitos Monoestáveis e Astáveis, Máquinas de estado,\nDispositivos lógicos programáveis, Descrição de circuitos e sistemas digitais utilizando linguagem de\ndescrição de hardware (HDL)."
          },
          {
            "codDisciplina": "ELTD12",
            "nome": "Laboratório de Eletrônica Digital II",
            "cargaHoraria": 16,
            "coRequisito": "ELTD02",
            "ementa": "Atividades práticas de laboratório abordando os conceitos de máquinas de estado e descrição de\ncircuitos e sistemas digitais utilizando linguagem de descrição de hardware (HDL)."
          },
          {
            "codDisciplina": "ECOM03",
            "nome": "Análise de Algoritmos",
            "cargaHoraria": 32,
            "preRequisitos": "ECOM02",
            "ementa": "Introdução à análise de algoritmos. Recursão. Complexidade dos métodos de ordenação. Métodos\nde projeto de algoritmos. Complexidade do problema."
          },
          {
            "codDisciplina": "ECOM13",
            "nome": "Laboratório de Análise de Algoritmos",
            "cargaHoraria": 16,
            "coRequisito": "ECOM03",
            "ementa": "Introdução à análise de algoritmos. Recursão. Complexidade dos métodos de ordenação. Métodos\nde projeto de algoritmos. Complexidade do problema."
          }
        ]
      },
      {
        "idPeriodo": 6,
        "disciplinas": [
          {
            "codDisciplina": "ELT052",
            "nome": "Materiais Elétricos e Eletrônicos",
            "cargaHoraria": 32,
            "preRequisitos": "QUI102\nELTA01",
            "ementa": "Conceitos básicos de ciência dos materiais, materiais condutores, materiais semicondutores,\nmateriais dielétricos, materiais magnéticos, materiais ópticos."
          },
          {
            "codDisciplina": "ELTD03",
            "nome": "Microntroladores e Microprocessadores",
            "cargaHoraria": 32,
            "preRequisitos": "ECOP01\nELTD02",
            "ementa": "Arquiteturas típicas de microprocessadores e microcontroladores. Estruturas de barramentos e\nmemórias. Periféricos e interfaces: I/O; Seriais; Timers; Counters, A/D; PWM; etc. Conjunto de\ninstruções. Pilha (stack). Subrotinas. Linguagem de programação de máquina (assembly). Aplicações em\ngeral e em interface homem-máquina."
          },
          {
            "codDisciplina": "ELTD13",
            "nome": "Lab. Microntroladores e Microprocessadores",
            "cargaHoraria": 32,
            "coRequisito": "ELTD03",
            "ementa": "Arquiteturas típicas de microprocessadores e microcontroladores. Estruturas de barramentos e\nmemórias. Periféricos e interfaces: I/O; Seriais; Timers; Counters, A/D; PWM; etc. Conjunto de\ninstruções. Pilha (stack). Subrotinas. Linguagem de programação de máquina (assembly). Aplicações em\ngeral e em interface homem-máquina."
          },
          {
            "codDisciplina": "ECAC02",
            "nome": "Controle Clássico",
            "cargaHoraria": 64,
            "preRequisitos": "ECAC01",
            "coRequisito": "ECAC12",
            "ementa": "Introdução: Sistemas dinâmicos e problemas de controle; Funções de transferência em malha\nfechada; Especificações de projeto: resposta do sistema em malha fechada; Erros em regime; Tipos de\ncontroladores e exemplos. Projetos de Controladores: Método do Lugar das Raízes: Construção do lugar\ndas raízes Compensação dinâmica: P, PI, PID, Lead - Lag. Método da Resposta em Freqüência:\nEstabilidade: critério de Bode e de Nyquist; Margem de ganho e margem de fase; Resposta em frequência\nem malha fechada; Especificações de projeto no domínio da freqüência; Compensação dinâmica: P, PI,\nPID, Lead-Lag. Aspectos práticos de implementação."
          },
          {
            "codDisciplina": "ECAC12",
            "nome": "Laboratório de Controle Clássico",
            "cargaHoraria": 16,
            "coRequisito": "ECAC02",
            "ementa": "Experiências em tópicos de controle Clássico; Análise e Compensação de sistemas utilizando\ntécnicas do Lugar das Raízes; Análise e Compensação de sistemas utilizando técnicas de Resposta em\nFrequência."
          },
          {
            "codDisciplina": "ECOT01",
            "nome": "Engenharia de Software I",
            "cargaHoraria": 32,
            "preRequisitos": "ECOP03",
            "coRequisito": "ECOT11",
            "ementa": "Ciclos de desenvolvimento de software. Introdução à sistemas de informação. Especificação eanálise de requisitos. Projeto de software. Implementação."
          },
          {
            "codDisciplina": "ECOT11",
            "nome": "Laboratório de Engenharia de Software I",
            "cargaHoraria": 16,
            "coRequisito": "ECOT01",
            "ementa": "Experiências de laboratório envolvendo: Ciclos de desenvolvimento de software. Introdução àsistemas de informação. Especificação e análise de requisitos. Projeto de software. Implementação."
          },
          {
            "codDisciplina": "ELTA02",
            "nome": "Eletrônica Analógica II",
            "cargaHoraria": 48,
            "preRequisitos": "ELTA01",
            "ementa": "Transistores de efeito de campo (FETs): Modelamento, Polarização e Amplificadores a pequeno\nsinal. Transistores MOS e CMOS. Resposta em frequência de amplificadores de pequeno sinal. Amplificadores de potência. Configurações compostas de amplificadores."
          },
          {
            "codDisciplina": "ELTA12",
            "nome": "Laboratório de Eletrônica Analógica II",
            "cargaHoraria": 16,
            "coRequisito": "ELTD02",
            "ementa": "Experiências de laboratório envolvendo: Transistores de efeito de campo (FETs): Modelamento,\nPolarização e Amplificadores a pequeno sinal. Transistores MOS e CMOS, Osciladores e temporizadores,\nastáveis, biestáveis, monoestáveis, 555."
          },
          {
            "codDisciplina": "TELC01",
            "nome": "Sistemas de Comunicação Analógica I",
            "cargaHoraria": 32,
            "preRequisitos": "MAT022",
            "coRequisito": "TELC11",
            "ementa": "Introdução aos Sistemas de comunicações. Análise de Fourier para sinais contínuos. Filtros de\nFrequência. Modulação em amplitude - AM. Modulação em ângulo – PM e FM. Sistemas de\nMultiplexação – SDM, FDM, TDM. Amostragem de Sinais. Modulação de Pulsos. Codificação digital de"
          },
          {
            "codDisciplina": "TELC11",
            "nome": "Lab. de Sistemas de Comunicação Analógica I",
            "cargaHoraria": 16,
            "coRequisito": "TELC01",
            "ementa": "Experiências de laboratório envolvendo: Análise de Fourier para sinais contínuos. Filtros de\nFrequência. Modulação em amplitude - AM. Modulação em ângulo – PM e FM. Sistemas de\nMultiplexação – SDM, FDM, TDM. Amostragem de Sinais. Modulação de Pulsos. Codificação digital de\nformas de onda (PCM). Transmissão digital em banda base. Modulação digital de portadora. Capacidade\ndo Canal. Introdução às comunicações ópticas. Introdução às comunicações móveis."
          },
          {
            "codDisciplina": "ECOM04",
            "nome": "Linguagens de Programação",
            "cargaHoraria": 32,
            "ementa": "Introdução ao estudo das linguagens de programação. Descrevendo sintaxe e semântica. Análise\nléxica e sintática. Nomes, ligação, checagem de tipos e escopo. Tipos de dados. Expressões e instruções\nde atribuição. Estruturas de controle no nível da instrução. Subprogramas. Implementando subprogramas."
          },
          {
            "codDisciplina": "ECOS01",
            "nome": "Sistemas Operacionais",
            "cargaHoraria": 64,
            "preRequisitos": "ECOP02",
            "ementa": "Introdução aos sistemas operacionais. Gerência de processos. Gerência de memória. Sistemas de\nE/S. Sistemas de arquivos. Estudos de casos. Unix. Qnx."
          }
        ]
      },
      {
        "idPeriodo": 7,
        "disciplinas": [
          {
            "codDisciplina": "MAT012",
            "nome": "Cálculo Numérico",
            "cargaHoraria": 64,
            "preRequisitos": "MAT001",
            "ementa": "Conceitos e princípios gerais em cálculo numérico. Raízes de equações. Sistemas de equações\nlineares. Interpolação e aproximação de funções a uma variável real. Integração numérica. Solução\nnumérica de equações diferenciais ordinárias. Ambientes computacionais avançados."
          },
          {
            "codDisciplina": "EAM002",
            "nome": "Ciências do Ambiente",
            "cargaHoraria": 64,
            "ementa": "Fundamentos de ecologia. Poluição ambiental. Tecnologias de controle de poluição. Gestão\nambiental. Legislação ambiental. Avaliação de impactos ambientais."
          },
          {
            "codDisciplina": "ECOM05",
            "nome": "Linguagens Formais",
            "cargaHoraria": 32,
            "preRequisitos": "ECOM02\nECOM04",
            "ementa": "Conceitos básicos de linguagens. Autômatos. Autômatos finitos. Linguagens regulares. Linguagens livres de contexto. Linguagens sensíveis ao contexto. Máquinas de turing. Linguagensrecursivamente enumeráveis."
          },
          {
            "codDisciplina": "ELTD04",
            "nome": "Microprocessador Avançado",
            "cargaHoraria": 48,
            "preRequisitos": "ELTD03",
            "coRequisito": "ELTD14",
            "ementa": "Microprocessador avançado: Unidade Central de Processamento. Memória Cache. Memória\nprincipal. Hierarquia de memória. Tool Chain: Assembler, Linker Debugger. Arquitetura do conjunto de\ninstruções: movimentação de dados, aritméricas, lógicas, controle e modos de endereçamento. Stacks e\nFunções. Instruções de ponto flutuante. Processamento paralelo: instruções SIMD, Multicore, DSP."
          },
          {
            "codDisciplina": "ELTD14",
            "nome": "Laboratório de Microprocessador Avançado",
            "cargaHoraria": 16,
            "coRequisito": "ELTD04",
            "ementa": "Experiências de laboratório envolvendo: Arquitetura básica e barramentos de processadores\navançados. Conceitos básicos: tipos de dados e sua organização na memória. Endereçamento da memória:\nOrganização física do espaço de endereçamento de memória, segmentação da memória, endereço linear,\nendereço físico e endereço lógico. Conjunto de registros. Modos de endereçamento. Instruções: conjunto\nde instrução. Código de máquina e tempo de execução. Interrupções. Programação assembly. Passagem\nde parâmetros para procedimentos (sub-rotinas). Modularização de programas escritos em linguagem assembly. Interfaces. co-processador aritmético."
          },
          {
            "codDisciplina": "ELTD05",
            "nome": "Projeto de Sistemas Digitais",
            "cargaHoraria": 32,
            "preRequisitos": "ELTD02",
            "coRequisito": "ELTD15",
            "ementa": "Famílias lógicas. Projeto de softcore empregando linguagem de descrição de hardware: ULA,\nunidade de memória, unidade de execução, controle de barramento."
          },
          {
            "codDisciplina": "ELTD15",
            "nome": "Laboratório de Projeto de Sistemas Digitais",
            "cargaHoraria": 32,
            "coRequisito": "ELTD05",
            "ementa": "Experiências de laboratório envolvendo: Famílias lógicas. Projeto de softcore empregando linguagem de descrição de hardware: ULA, unidade de memória, unidade de execução, controle de\nbarramento. linguagem de descrição de hardware: ULA, unidade de memória, unidade de execução, controle de\nbarramento."
          },
          {
            "codDisciplina": "ECOT02",
            "nome": "Engenharia de Software II",
            "cargaHoraria": 32,
            "preRequisitos": "ECOT01",
            "coRequisito": "ECOT12",
            "ementa": "Diagrama de classe (encapsulamento e relacionamentos). Mapeamento de classes em Java.\nPadrões de Interface. Padrões de responsabilidade. Padrões de Construção. Padrões de Operação. Padrões\nde Extensão."
          },
          {
            "codDisciplina": "ECOT12",
            "nome": "Laboratório de Engenharia de Software II",
            "cargaHoraria": 32,
            "coRequisito": "ECOT02",
            "ementa": "Experiências de laboratório envolvendo: Diagrama de classe (encapsulamento e relacionamentos).\nMapeamento de classes em Java. Padrões de Interface. Padrões de responsabilidade. Padrões de\nConstrução. Padrões de Operação. Padrões de Extensão."
          },
          {
            "codDisciplina": "ECAC04",
            "nome": "Processamento Digital de Sinais",
            "cargaHoraria": 32,
            "coRequisito": "ECAC14",
            "ementa": "Introdução ao processamento digital de sinais. Fundamentos de sistemas amostrados lineares.\nImplementação de sistemas discretos. Filtros digitais. Transformada discreta de Fourier. Transformadarápida de Fourier – FFT."
          },
          {
            "codDisciplina": "ECAC14",
            "nome": "Lab. de Processamento Digital de Sinais",
            "cargaHoraria": 16,
            "coRequisito": "ECAC04",
            "ementa": "Experiências de laboratório envolvendo: Introdução ao processamento digital de sinais.\nFundamentos de sistemas amostrados lineares. Implementação de sistemas discretos. Filtros digitais.\nTransformada discreta de Fourier. Transformada rápida de Fourier – FFT."
          },
          {
            "codDisciplina": "TELC02",
            "nome": "Sistemas de Comunicação Digital",
            "cargaHoraria": 32,
            "preRequisitos": "TELC01",
            "coRequisito": "TELC12",
            "ementa": "Circuitos para modulação em amplitude e ângulo. Problema da Interferência Intersimbólica. Canal\nde Nyquist. Formatação de Pulso. Modulação Multi-Portadora. Análise de Fourier para Sinais Discretos. \n\"Aplicação de Filtros Digitais em Comunicação Digital. Ruído nos esquemas de modulação em amplitude\ne ângulo. Ruído em comunicações digitais. Teoria da Informação. Códigos de controle de erro.\"\nModulação por espalhamento espectral e CDMA."
          },
          {
            "codDisciplina": "TELC12",
            "nome": "Lab. de Sistemas de Comunicação Digital",
            "cargaHoraria": 32,
            "coRequisito": "TELC02",
            "ementa": "Experiências de laboratório envolvendo: Circuitos para modulação em amplitude e ângulo.\nProblema da Interferência Intersimbólica. Canal de Nyquist. Formatação de Pulso. Modulação Multi-\nPortadora. Análise de Fourier para Sinais Discretos. Aplicação de Filtros Digitais em Comunicação\nDigital. Ruído nos esquemas de modulação em amplitude e ângulo. Ruído em comunicações digitais.\nTeoria da Informação. Códigos de controle de erro. Modulação por espalhamento espectral e CDMA."
          }
        ]
      },
      {
        "idPeriodo": 8,
        "disciplinas": [
          {
            "codDisciplina": "MAT013",
            "nome": "Probabilidade e Estatística",
            "cargaHoraria": 64,
            "preRequisitos": "MAT001",
            "ementa": "Noções básicas de probabilidade. Variáveis aleatórias. Distribuições de probabilidade. Teoremas\nlimite. Introdução à estatística. Descrição, exploração e comparação de dados. Estimativas e tamanhos de\namostras. Teste de hipóteses."
          },
          {
            "codDisciplina": "SOC002",
            "nome": "Ciências Humanas e Sociais",
            "cargaHoraria": 48,
            "ementa": "O conhecimento das ciências humanas e seus fundamentos. As dimensões do humano e a\nconstrução de si. O indivíduo no social (ética). Processos e institucionalizações. Cultura e trabalho."
          },
          {
            "codDisciplina": "EPR002",
            "nome": "Organização Industrial e Administração",
            "cargaHoraria": 48,
            "ementa": "Organização industrial e administração. Administração de pessoal. Planejamento e controle da\nprodução. Administração de materiais. Gestão da qualidade e sistemas de garantia da qualidade."
          },
          {
            "codDisciplina": "ECOM06",
            "nome": "Compiladores",
            "cargaHoraria": 32,
            "preRequisitos": "ECOM05",
            "ementa": "Introdução a compiladores. Análise léxica. Análise sintática. Análise top-down e bottom-up."
          },
          {
            "codDisciplina": "ELTD06",
            "nome": "Computadores Digitais",
            "cargaHoraria": 64,
            "preRequisitos": "ELTD03",
            "ementa": "Conceitos e tecnologia. Análise de desempenho. Instruções: linguagem de máquina. Aritméticapara computadores. O processador. Pipelining. Organização de memória. Organização de sistemas de E/S."
          },
          {
            "codDisciplina": "ECOT03",
            "nome": "Banco de Dados",
            "cargaHoraria": 32,
            "preRequisitos": "ECOP02\nECOT02",
            "coRequisito": "ECOT13",
            "ementa": "SGBDR. ME-R e ME-Rx. Modelo relacional. Mapeamento ME-Rx para relacional. SQL-DCL."
          },
          {
            "codDisciplina": "ECOT13",
            "nome": "Laboratório de Banco de Dados",
            "cargaHoraria": 32,
            "coRequisito": "ECOT03",
            "ementa": "Experiências de laboratório envolvendo: SGBDR. ME-R e ME-Rx. Modelo relacional."
          },
          {
            "codDisciplina": "TELC03",
            "nome": "Redes de Computadores",
            "cargaHoraria": 32,
            "preRequisitos": "ECOM02",
            "ementa": "Conceitos e tecnologia. Análise de desempenho. Instruções: linguagem de máquina. Aritméticapara computadores. O processador. Pipelining. Organização de memória. Organização de sistemas de E/S."
          },
          {
            "codDisciplina": "TELC13",
            "nome": "Laboratório de Redes de Computadores",
            "cargaHoraria": 16,
            "coRequisito": "TELC03",
            "ementa": "Introdução às redes de computadores. Conceitos e terminologia. Transmissão de dados."
          },
          {
            "codDisciplina": "ECO040",
            "nome": "Metodologia de Pesquisa Aplicada à\nComputação",
            "cargaHoraria": 32,
            "ementa": "Experiências de laboratório envolvendo: Introdução às redes de computadores. Conceitos e\nterminologia. Transmissão de dados. Comunicação à longa distância. Transmissão de pacotes."
          }
        ]
      },
      {
        "idPeriodo": 9,
        "disciplinas": [
          {
            "codDisciplina": "EPR502",
            "nome": "Engenharia Econômica",
            "cargaHoraria": 48,
            "ementa": "Conhecimento científico. Métodos e técnicas de pesquisa. Estilos de pesquisa em Computação."
          },
          {
            "codDisciplina": "ECOT04",
            "nome": "Inteligência Artificial",
            "cargaHoraria": 48,
            "preRequisitos": "ECOM03",
            "ementa": "Matemática financeira. Critérios para análise de investimentos. Depreciação e imposto de renda."
          },
          {
            "codDisciplina": "ECOS02",
            "nome": "Sistemas Distribuídos",
            "cargaHoraria": 48,
            "preRequisitos": "ECOS01",
            "ementa": "Introdução. Conceitos básicos de agente inteligentes. Problemas, spaço de problemas e\nmecanismos de busca. Representação de conhecimentos. Agentes que resolvem problemas através de\nbusca, agentes baseado em conhecimentos e agentes que desenvolvem raciocínio. Introdução a Redes\nNeurais, lógica fuzzy, algoritmos genéticos, planejamento e aprendizagem."
          },
          {
            "codDisciplina": "ECOS12",
            "nome": "Laboratório de Sistemas Distribuídos",
            "cargaHoraria": 32,
            "coRequisito": "ECOS02",
            "ementa": "Caracterização de sistemas distribuídos. Arquitetura dos sistemas operacionais distribuídos."
          },
          {
            "codDisciplina": "ECO921",
            "nome": "Tópicos Especiais em Computação",
            "cargaHoraria": 48,
            "ementa": "Experiências de laboratório envolvendo: Arquitetura dos sistemas operacionais distribuídos."
          }
        ]
      }
    ]
  }
]
